Repository: lawrancej/logisim
Catalog: xlate/ru/www/omegat-logisim-www_ru-level2.tmx
Source language: en_us
Languages: ru_ru

source: Is that OK?
ru_ru: Это не проблема?

source: Bug reports, feature requests, and questions (in English please!) are welcome at Logisim's page at SourceForge.net.
ru_ru: Отчеты об ошибках, пожелания и вопросы (на английском языке, пожалуйста!) приветствуются на странице Logisim на SourceForge.net.

source: LogicWorks is a Windows-specific commercial product also, but it seems more likely to receive continuing support.
ru_ru: LogicWorks - это тоже специфичный для Windows коммерческий продукт, но кажется, получает постоянную поддержку.

source: France
ru_ru: Франция

source: View and add comments
ru_ru: Просмотр и добавление комментариев

source: The JAR library described in the Logisim User's Guide for version 2.3.0 and later.
ru_ru: JAR библиотека, описанная в руководстве пользователя Logisim для версии 2.3.0 и выше.

source: Thank you!
ru_ru: Спасибо!

source: What are your plans for future revisions?
ru_ru: Каковы ваши планы на будущие изменения?

source: VA
ru_ru: Виргиния

source: Comments are welcome.
ru_ru: Комментарии приветствуются.

source: EasySim, commercial Windows
ru_ru: EasySim, коммерческий для Windows

source: This is a highly difficult feature to include in general due to the fact that Logisim's wires are always axis-aligned.
ru_ru: Это очень трудная для добавления возможность в основном из-за того, что провода Logisim всегда выровнены по направляющим.

source: It has some utility if you're spending one or two weeks introducing students to the subject.
ru_ru: Он довольно удобен, если вы тратите одну или две недели на введение студентов в тему.

source: UT
ru_ru: Юта

source: You might as well cut out the middleman and just donate the money directly to a real charity.
ru_ru: Вы можете убрать посредника и просто отдать деньги непосредственно на настоящую благотворительность.

source: Can I place a copy of the JAR file on a Web page for my students to download?
ru_ru: Могу ли я разместить копию JAR файла на веб-странице для загрузки моими студентами?

source: Here's a list of links, and you can judge for yourself.
ru_ru: Вот список ссылок, и вы можете судить сами.

source: With the MacOS X version: Once the downloaded .tar.gz version is uncompressed (this will likely happen automatically), just double-click the Logisim icon to start.
ru_ru: Для MacOS X версии: когда загруженный файл .tar.gz распакован (это наверняка произойдёт автоматически), просто дважды щёлкните на значке Logisim, чтобы запустить его.

source: But if it's a major textbook, I encourage you to contact me to discuss how Logisim can be altered to complement the textbook better.
ru_ru: Но если это основной учебник, то я призываю вас связаться со мной, чтобы обсудить, как может быть изменён Logisim, чтобы лучше дополнять учебник.

source: Of course; that usage would fall within the GPL.
ru_ru: Конечно, всё в порядке; такое использование будет подпадать под GPL.

source: If you find Logisim useful, please let me know!
ru_ru: Если вы находите Logisim полезным, пожалуйста, дайте мне знать!

source: Logisim: Future plans
ru_ru: Logisim: планы на будущее

source: Canada
ru_ru: Канада

source: Especially do this if you use Logisim in a class you teach! E-mail me at the address given below.
ru_ru: Тем более сделайте это, если вы используете Logisim в курсе, который вы преподаёте! Напишите мне по адресу электронной почты, указанному ниже.

source: TX
ru_ru: Техас

source: KLogic, open source Linux
ru_ru: KLogic, с открытым исходным кодом, для Linux

source: As of Beta 17, it is included in the distributed JAR file (as its src subdirectory).
ru_ru: Начиная с Beta 17, он входит в распространяемый JAR файл (в его подкаталоге src).

source: Iceland
ru_ru: Исландия

source: 18 Jul 2007.
ru_ru: 18 июля 2007.

source: Can I get a copy of the source code?
ru_ru: Могу ли я получить копию исходного кода?

source: Iowa Logic Specification Language, open source, uses custom language
ru_ru: Iowa Logic Specification Language, с открытым исходным кодом, использует собственный язык

source: GA
ru_ru: Джорджия

source: Logisim should run on any platform supporting Java, version 1.4 or later.
ru_ru: Logisim должен работать на любой платформе, поддерживающей Java версии 1.5 или выше.

source: Lebanon
ru_ru: Ливан

source: Commercial graphical tools
ru_ru: Коммерческие графические инструменты

source: How do you pronounce Logisim?
ru_ru: Как вы произносите Logisim?

source: My hope is that some day some other software developers out there will create something that in my view renders Logisim irrelevant.
ru_ru: Я надеюсь, что когда-нибудь где-то там разработчики другого программного обеспечения создадут что-то, что сделает Logisim бесполезным по моему мнению.

source: [Instructions for downloading Logisim (English)]
ru_ru: [Инструкции по загрузке Logisim]

source: If you have your own library of components that you think would be useful to others, I'll be happy to post a link here to a hosting Web site or to the library itself.
ru_ru: Если у вас есть собственные библиотеки компонентов, которые могут быть полезны для других, я буду рад разместить здесь ссылку на содержащий её веб-сайт или на саму библиотеку.

source: It requires tcl/tk to run; it can run on Windows if you have Cygwin installed.
ru_ru: Он требует tcl/tk для запуска; может работать на Windows, если у вас установлен Cygwin.

source: To the extent that Logisim is sluggish, you may be inclined to blame it on the Java environment; but you'd be wrong.
ru_ru: В том, что Logisim медленный, вы возможно обвините среду Java; но вы не правы.

source: For text labels, allow regions of text to be selected, and perhaps enhance the text editing facility in other ways.
ru_ru: Для текстовых меток возможно выделять участки текста, и может быть осуществлять некоторые другие способы редактирования текста.

source: Read history of previous releases
ru_ru: История предыдущих выпусков

source: The pop-up menu that appears for elements in the selection will include cut/copy/paste/delete menu items.
ru_ru: Всплывающее меню, которое отображается для элементов выделения будет включать в себя пункты меню вырезать/копировать/вставить/удалить.

source: Logisim: Comments
ru_ru: Logisim: комментарии

source: I've heard people pronounce it LOG-ism, and that's just wrong.
ru_ru: Я слышал, как люди произносят ЛОГ-изм, и это просто неправильно.

source: Circuit images can be exported as PNGs or JPGs (not just GIFs).
ru_ru: Изображения схем можно экспортировать как PNG и JPG (не только GIF).

source: LODJ-uh-sim.
ru_ru: ЛОДЖ-и-сим.

source: LOCAD, commercial(?) Windows, in German
ru_ru: LOCAD, коммерческий(?) для Windows, на немецком

source: WA
ru_ru: Вашингтон

source: This is a complete rewrite, multiplying Logisim's size by a factor of five over the previous 1.0x series.
ru_ru: Она полностью переписана, размер Logisim увеличился в пять раз по сравнению с предыдущими 1.0x версиями.

source: Ok, first of all, this is a Q&A page, and that's not a question or an answer.
ru_ru: Хорошо, во-первых, это страница вопросов и ответов, а это не вопрос и не ответ.

source: I haven't noticed that this inefficiency causes speed problems, and so I've concentrated on adding features instead of worrying over what appears to be a non-problem.
ru_ru: Я не заметил, что неэффективность вызывает проблемы со скоростью, и поэтому я сосредоточился на добавлении возможностей, вместо переживаний о том, что не вызывает проблем.

source: New Zealand
ru_ru: Новая Зеландия

source: A Russian translation (developed by Ilia Lilov) is included as part of the standard Logisim release.
ru_ru: Перевод на русский язык интерфейса программы и всей документации входит в состав стандартного выпуска Logisim (переводчик - Илья Лилов).

source: If you use MacOS or Windows, I would recommend using the release specific to your platform.
ru_ru: Если вы используете Windows или MacOS, я бы рекомендовал использовать версию, специфичную для вашей платформы.

source: Visit related links
ru_ru: Ссылки по теме

source: Taiwan
ru_ru: Тайвань

source: Can I pay you?
ru_ru: Могу я заплатить вам?

source: Free graphical tools
ru_ru: Бесплатные графические инструменты

source: Please contact me if you are interested in developing libraries.
ru_ru: Пожалуйста свяжитесь со мной если вы заинтересованы в разработке библиотек.

source: Greece
ru_ru: Греция

source: A set of Logisim circuits corresponding to a large number of 7400-series chips, produced by Technological Services Company.
ru_ru: Набор схем Logisim, соответствующих большому числу микросхем 7400 серии, произведённых компанией Technological Services Company.

source: Logisim is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
ru_ru: Logisim распространяется в надежде, что он будет полезным, но БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, даже без подразумеваемых гарантий КОММЕРЧЕСКОЙ ЦЕННОСТИ или ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ.

source: If that doesn't work, or if you use Linux or Solaris, you can type ``java -jar logisim-XX.jar'' at the command line.
ru_ru: Если это не работает, или если вы используете Linux или Solaris, то вы можете напечатать"java -jar logisim-XX.jar"В командной строке.

source: After starting Logisim, select Preferences… from the File menu.
ru_ru: После запуска Logisim, выберите пункт Preferences… из меню File.

source: I don't expect this capacity to ever be in Logisim: It introduces too many interface complexities.
ru_ru: Я не думаю, что эта возможность будет когда-нибудь в Logisim: она вводит слишком много сложностей в интерфейс.

source: Cyprus
ru_ru: Кипр

source: United States of America
ru_ru: Соединенные Штаты Америки

source: You can also contact Carl Burch, the primary developer, directly at cburch@cburch.com.
ru_ru: Вы также можете связаться с Карлом Берчем (Carl Burch), основным разработчиком, прямо через cburch@cburch.com.

source: One thing you'll notice is that I have almost no concrete plans for adding new components to Logisim's libraries. I am hoping that collaborators will step forward to develop new components using the JAR library facility, which can then be built into future Logisim releases.
ru_ru: Одна вещь, которую вы заметите - это то, что у меня почти нет конкретных планов для добавления новых компонентов в библиотеки Logisim. Я надеюсь, что соавторы пойдут дальше в разработке новых компонентов, пользуясь возможностью создания JAR библиотек, которые затем могут быть встроены в будущих версиях Logisim.

source: Please remember that you aren't paying for Logisim.
ru_ru: Пожалуйста, помните, что вы не платите за Logisim.

source: The appearance here doesn't consitute a definite plan, but the following is the rough road map for future releases.
ru_ru: Появление возможности здесь не объявляет точный план; представленное ниже - примерный путеводитель для будущих выпусков.

source: (I would admit that startup is a bit sluggish, though.)
ru_ru: (Правда, вынужден признать, что запуск немного медленный.)

source: Comments
ru_ru: Комментарии

source: AR
ru_ru: Арканзас

source: The outdated JAR library described in the Logisim User's Guide prior to version 2.3.0.
ru_ru: Устаревшая JAR библиотека, описанная в руководстве пользователя Logisim до версии 2.3.0.

source: User can add labels to registers, similar to how pins and clocks can have labels attached to them.
ru_ru: Пользователь может добавить метки регистрам, подобно тому, как контакты и генераторы тактовой частоты могут иметь привязанные к ним метки.

source: Getting Logisim
ru_ru: Получение Logisim

source: Why is Logisim so darn slow?
ru_ru: Почему Logisim такой чертовски медленный?

source: Logisim requires Java 1.4 or later.
ru_ru: Logisim требует Java 1.5 или более поздней версии.

source: AZ
ru_ru: Аризона

source: A Windows .exe file
ru_ru: Файл .exe для Windows

source: Schools using Logisim.
ru_ru: Образовательные учреждения, использующие Logisim.

source: To execute the program:
ru_ru: Чтобы запустить программу:

source: I value all e-mails received about Logisim, as I want it to become as useful an educational tool as possible.
ru_ru: Я ценю все электронные письма, полученные о Logisim, поскольку я хочу, чтобы он стал настолько полезным образовательным инструментом, насколько это возможно.

source: Select the International tab in the Preferences window.
ru_ru: Выберите вкладку International в окне Preferences.

source: It does not seem to be under active development.
ru_ru: Он, похоже, не в стадии активной разработки.

source: An open-source graphical tool for designing and simulating logic circuits
ru_ru: Графический инструмент с открытым исходным кодом проектирования и моделирования логических схем

source: Croatia
ru_ru: Хорватия

source: Planned features
ru_ru: Планируемые возможности

source: Sweden
ru_ru: Швеция

source: Serbia
ru_ru: Сербия

source: Logisim release history
ru_ru: История выпусков Logisim

source: Future plans
ru_ru: Планы на будущее

source: Logisim is an open source Java tool.
ru_ru: Logisim - Java инструмент с открытым исходным кодом.

source: Bug reports, feature requests, and questions are most welcome at Logisim's page at SourceForge.net.
ru_ru: Отчеты об ошибках, пожелания и вопросы особенно приветствуются на странице Logisim на SourceForge.net.

source: Gray Counter example (JAR)
ru_ru: Пример счётчика Грея (JAR)

source: TN
ru_ru: Теннесси

source: CA
ru_ru: Калифорния

source: Features requested but not planned
ru_ru: Запрошенные, но не планируемые возможности

source: China
ru_ru: Китай

source: And thanks for the suggestion!
ru_ru: И спасибо за предложение!

source: Update: Logisim 2.3.5 is now available. Changes from previous releases.
ru_ru: Обновление: Теперь доступен Logisim 2.5.0. Изменения по сравнению с предыдущими версиями.

source: Inasmuch as it is slow, it is because I lack the time or incentive to make it fast.
ru_ru: Он медленный потому, что мне не хватает ни времени, ни стимула сделать его быстрым.

source: Affirmative comments will help me get support to develop the program further, and helpful comments will point out what is most important for future versions.
ru_ru: Позитивные комментарии помогут мне получить поддержку для дальнейшей разработки программы, а полезные замечания будут указывать, что наиболее важно для будущих версий.

source: Logisim is open-source software, and it runs under Windows, Linux, and Macintosh.
ru_ru: Logisim - программное обеспечение с открытым исходным кодом и работает под управлением Windows, Linux и Macintosh.

source: [Russian-language documentation]
ru_ru: [Документация на русском языке]

source: SourceForge.net Logo
ru_ru: Логотип SourceForge.net

source: Others:
ru_ru: Прочие:

source: Belgium
ru_ru: Бельгия

source: You will three choices of which release to download.
ru_ru: У вас будет на выбор три версии для загрузки.

source: (Also, for those found through Web searches, I look for specific evidence that the software package is not an obscure competitor that happens to share Logisim's name.)
ru_ru: (Кроме того, для найденных через веб-поиск, я ищу конкретные доказательства того, что программный пакет не является просто одноимённым конкурентом Logisim.)

source: If you find Logisim useful, please send me a comment!
ru_ru: Если Вы находите Logisim полезным, пожалуйста пошлите мне комментарий!

source: CO
ru_ru: Колорадо

source: Portugal
ru_ru: Португалия

source: The following is the wish list; I hope that most of these will appear some time in Summer 2006.
ru_ru: Ниже приводится список пожеланий; я надеюсь, что большинство из них появится как-нибудь летом 2006 года.

source: (30 May 2010)
ru_ru: (XX августа 2010)

source: Digital Works 3.0 is a commercial Windows product; I have not tried it, but presumably it is more thorough than Digital Works 2.0, which was already good.
ru_ru: Digital Works 3.0 - коммерческий продукт для Windows; я его не пробовал, но предположительно он более проработанный, чем Digital Works 2.0, который уже было хорош.

source: Chile
ru_ru: Чили

source: Logisim: Worldwide usage
ru_ru: Logisim: использование по всему миру

source: Questions &amp; Answers
ru_ru: Вопросы и ответы

source: Digital Works 2.0 is Windows freeware.
ru_ru: Digital Works 2.0 - бесплатная программа для Windows.

source: Libraries
ru_ru: Библиотеки

source: MI
ru_ru: Мичиган

source: Customize appearances for Logisim-designed components (i.e., subcircuit components), instead of having them all appear as blank rectangles.
ru_ru: Настройка внешности разработанных в Logisim компонентов (например подсхем), вместо отображения их в виде пустых прямоугольников.

source: Add feature X now!
ru_ru: Добавьте возможность X сейчас же!

source: User can configure whether pins and constants are displayed in binary, hexadecimal, or decimal.
ru_ru: Пользователь может настроить, как отображаются контакты и константы: в двоичном, шестнадцатеричном или десятичном формате.

source: If you're using Logisim as a required portion of a class assignment, and your school isn't on the list, please send an e-mail!
ru_ru: Если вы используете Logisim как необходимую часть заданий курса, а ваше учебное заведение не входит в список, пожалуйста сообщите об этом по электронной почте!

source: Screen shot of Logisim 2.3.5, released May 30, 2010
ru_ru: Снимок экрана Logisim 2.5.0, выпущенного XX августа 2010

source: Logisim is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ru_ru: Logisim является свободным программным обеспечением; вы можете его распространять и/или модифицировать в соответствии с условиями Универсальной общественной лицензией GNU, опубликованной Free Software Foundation; либо версии 2 Лицензии, либо (по вашему выбору) любой более поздней версии.

source: MA
ru_ru: Массачусетс

source: Logisim: Questions and answers
ru_ru: Logisim: вопросы и ответы

source: VeriWell, open source, uses Verilog
ru_ru: VeriWell, с открытым исходным кодом, использует Verilog

source: MN
ru_ru: Миннесота

source: Turkey
ru_ru: Турция

source: Schools using Logisim
ru_ru: Учебные заведения, использующие Logisim

source: You may want to place the icon into the Applications folder.
ru_ru: Вы можете поместить значок в папку "Приложения".

source: Logisim is an educational tool for designing and simulating digital logic circuits.
ru_ru: Logisim - это образовательный инструмент для разработки и моделирования цифровых логических схем.

source: MS
ru_ru: Миссисипи

source: Logisim is used by students at colleges and universities around the world in many types of classes, ranging from a brief unit on logic in general-education computer science surveys, to computer organization courses, to full-semester courses on computer architecture.
ru_ru: Logisim используется студентами колледжей и университетов по всему миру во многих типах курсов, начиная от краткого курса по логике в обзорном изучении информатики в общеобразовательных учреждениях, кончая курсами по организации ЭВМ и полными курсами по архитектуре компьютеров.

source: Other alternatives I have investigated, but which don't yet seem have much to recommend them:
ru_ru: Другие варианты, которые я просмотрел, но которые пока еще не стоят, чтобы их рекомендовать:

source: Above, I have tried to list only those institutions where I feel there is firm information that Logisim has been assigned directly for use by students.
ru_ru: Выше я постарался внести в список только те учреждения, для которых, на мой взгляд, существует достоверная информация, что Logisim был прямо назначен для использования учащимися.

source: With the capacity to build larger circuits from smaller subcircuits, and to draw bundles of wires with a single mouse drag, Logisim can be used (and is used) to design and simulate entire CPUs for educational purposes.
ru_ru: При возможности постройки больших схем из меньших подсхем и рисования пучков проводов одним перетаскиванием мыши, Logisim может быть использован (и используется) для проектирования и моделирования целых процессоров в образовательных целях.

source: NJ
ru_ru: Нью-Джерси

source: To use the Russian translation:
ru_ru: Для использования русского перевода:

source: esim, source available but license unclear, uses custom language
ru_ru: esim, исходные коды доступны, но лицензия неясная, использует собственный язык

source: It doesn't simulate circuits as you build them, but its simulation capabilities are more extensive than Logisim's.
ru_ru: Он не моделирует схемы, пока вы проектируете их, но его возможности моделирования более обширны, чем в Logisim.

source: NY
ru_ru: Нью-Йорк

source: 7400 series Logisim library (ZIP, uncompressed)
ru_ru: Библиотека Logisim для 7400 серии (ZIP, несжатая)

source: Home page
ru_ru: Главная страница

source: (This is of course redundant because the Wiring tool already does it; but somebody requested it, and it sounds easy enough to add.)
ru_ru: (Это, конечно, уже излишество, поскольку Инструмент Проводки уже делает это; но кто-то просил, и похоже это достаточно просто добавить.)

source: Colombia
ru_ru: Колумбия

source: This is not for massaging my ego: The more broadly the program is used, the easier it is for me to get support from my college and from elsewhere to continue development of the program.
ru_ru: Это не для того, чтобы потешить моё эго: чем шире использование программы, тем легче будет мне получить поддержку в своём колледже и других местах для продолжения её разработки.

source: Switzerland
ru_ru: Швейцария

source: MultiMedia Logic is open source Windows software; It doesn't seem to support hierarchical circuits or wire bundling, so it's quite limited as far as designing CPU-scale circuits, but it does provide a fun set of I/O components.
ru_ru: MultiMedia Logic - программа для Windows с открытым исходным кодом, но похоже не поддерживает иерархические схемы или составление пучков из проводов, так что она весьма ограничена, по крайней мере для разработки схем масштаба процессора, но она предоставляет интересный набор компонентов ввода/вывода.

source: OH
ru_ru: Огайо

source: HADES is a Java-based tool, which is available at no cost but does not appear to be open-source.
ru_ru: HADES представляет собой Java-инструмент, который доступен бесплатно, но не собирается быть с открытым исходным кодом.

source: Related links
ru_ru: Ссылки по теме

source: Icarus Verilog, the dominant open-source Verilog compiler
ru_ru: Icarus Verilog , лидирующий компилятор Verilog с открытым исходным кодом

source: I have not tried it, but it seems like a thorough system.
ru_ru: Я не пробовал его, но кажется, это законченная система.

source: Download Logisim from Logisim's SourceForge.net page.
ru_ru: Скачать Logisim со страницы Logisim на SourceForge.net .

source: Draw wires in diagonal directions (not horizontal/vertical).
ru_ru: Рисование проводов в диагональных направлениях (не по горизонтали/вертикали).

source: First: Please let me know that you are using the program for your class.
ru_ru: Во-первых: пожалуйста, дайте мне знать, что вы используете программу для вашего курса.

source: So I occasionally browse the competition to see whether that day has come.
ru_ru: Так что я время от времени слежу за конкуренцией, чтобы увидеть, не настал ли этот день.

source: xLogicCircuits is my favorite among the bare-bones Java applets.
ru_ru: xLogicCircuits - мой любимый среди Java апплетов.

source: A MacOS .tar.gz file
ru_ru: Файл .tar.gz для MacOS

source: OR
ru_ru: Орегон

source: Version 2.3.5 (30 May 2010)
ru_ru: Версия 2.3.5 (30 мая 2010)
